IDEA Open Model
ConcreteCheckDetailing Class
Compatible with IDEA StatiCa Beta 20.0
 Check Detailing base
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Concrete.CheckResult.ConcreteCheckResultBase
 IdeaRS.OpenModel.Concrete.CheckResult.ConcreteCheckDetailing
 IdeaRS.OpenModel.Concrete.CheckResult.ConcreteCheckDetailingEc2
 Namespace: IdeaRS.OpenModel.Concrete.CheckResult
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public abstract class ConcreteCheckDetailing : ConcreteCheckResultBase
Public MustInherit Class ConcreteCheckDetailing
	Inherits ConcreteCheckResultBase
The ConcreteCheckDetailing type exposes the following members.
Constructors
Name | Description
ConcreteCheckDetailing
Initializes a new instance of the ConcreteCheckDetailing class
Top
Properties
Name | Description
Check
 settings of check type
 (Inherited from ConcreteCheckResultBase.)
CheckValue
 calculated limited value, calculated as strain to limit strain
 (Inherited from ConcreteCheckResultBase.)
InternalFores
 internal forces used for calculation
 (Inherited from ConcreteCheckResultBase.)
LimitCheckValue
 limit check value for result check
 (Inherited from ConcreteCheckResultBase.)
NonConformities
 Returns nonconformity in section
 (Inherited from ConcreteCheckResultBase.)
Result
 check result passed/failed
 (Inherited from ConcreteCheckResultBase.)
Top
See Also
Reference
IdeaRS.OpenModel.Concrete.CheckResult Namespace